## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/14231102887)



<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.signify_secret_rotator.google_monitoring_alert_policy.signify_secret_rotator_error_alert



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.signify_secret_rotator.google_monitoring_alert_policy.signify_secret_rotator_error_alert will be created
  + resource "google_monitoring_alert_policy" "signify_secret_rotator_error_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Error detected in signify-secret-rotator"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = "sap-kyma-prow"
      + severity              = "ERROR"

      + alert_strategy {
          + auto_close = "604800s"

          + notification_rate_limit {
              + period = "259200s"
            }
        }

      + conditions {
          + display_name = "Error in signify-secret-rotator logs"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"signify-secret-rotator\" AND severity>=ERROR"
            }
        }

      + documentation {
          + content   = <<-EOT
                ### Alert: Error detected in signify-secret-rotator
                
                #### Summary:
                A new error has been detected in the Cloud Run service *signify-secret-rotator*.
                
                #### Error details:
                - **Service Name:** ${resource.labels.service_name}
                - **Project ID:** ${resource.project}
                
                #### Quick Links:
                - [View Logs](https://console.cloud.google.com/logs/query;query=resource.labels.service_name="signify-secret-rotator")
            EOT
          + mime_type = "text/markdown"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2025-04-02T09:02:41.592774Z" -> "2025-04-02T14:22:24.286152Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
  ~ service_account_keys_cleaner                   = {
      ~ service_account_keys_cleaner_cloud_run_service = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "322ed3bf-d21f-48ec-ad76-837953667461" -> "995885ce-ac2d-4720-940a-912674932156"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 190 -> 191
                  ~ resource_version      = "AAYxvceyvmM" -> "AAYxyNMIlgo"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-cleaner"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-cleaner-00190-q2s" -> "service-account-keys-cleaner-00191-s79"
                  ~ latest_ready_revision_name   = "service-account-keys-cleaner-00190-q2s" -> "service-account-keys-cleaner-00191-s79"
                  ~ observed_generation          = 190 -> 191
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-cleaner-00190-q2s" -> "service-account-keys-cleaner-00191-s79"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
  ~ service_account_keys_rotator                   = {
      ~ service_account_keys_rotator_cloud_run_service   = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "98798447-1f87-4e9b-b364-7e33563fef9f" -> "3ad8c1ae-b685-4aaf-909c-57b9e44acd3e"
                      ~ "serving.knative.dev/lastModifier"  = "patryk.dobrowolski@sap.com" -> "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 191 -> 192
                  ~ resource_version      = "AAYxvjBXBvI" -> "AAYxyNMzqDs"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-rotator"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-rotator-00191-7k7" -> "service-account-keys-rotator-00192-vcd"
                  ~ latest_ready_revision_name   = "service-account-keys-rotator-00191-7k7" -> "service-account-keys-rotator-00192-vcd"
                  ~ observed_generation          = 191 -> 192
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-rotator-00191-7k7" -> "service-account-keys-rotator-00192-vcd"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2025-04-02T09:02:41.592774Z" -> "2025-04-02T14:22:24.286152Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":12877,"Program":"tfcmt","SHA1":"df4f69e1522c213482cb1dd3d1344118f97d81d5","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->